In [1]:
import pandas as pd
df=pd.read_csv("C:\\Users\\Gaja Lakshmi\\Desktop\\python\\sample_student.csv")
df

           NAME  AGE GENDER   DEPT  SALARY
0       lakshmi   23      F    cse   50000
1         usha    22      F    ece   70000
2  venkateswari   21      F    ece   60000
3         navya   25      F   mech   75000
4       bhuvana   22      F  civil   50000
5        vanaja   24      F    cse   55000
6      usha sri   25      F   mech   72000
7           sai   22      M    cse   80000
8         subbu   24      M    eee   70000
9         pandu   24      M  civil   50000

In [3]:
df.groupby(["GENDER"]).mean()

              AGE        SALARY
GENDER
F       23.142857  61714.285714
M       23.333333  66666.666667

In [2]:
df.groupby(["SALARY"]).mean()

         AGE
SALARY
50000   23.0
55000   24.0
60000   21.0
70000   23.0
72000   25.0
75000   25.0
80000   22.0

In [54]:
df.groupby(["DEPT"]).mean()

        AGE        SALARY
DEPT
civil  23.0  50000.000000
cse    23.0  61666.666667
ece    21.5  65000.000000
eee    24.0  70000.000000
mech   25.0  73500.000000

In [5]:
df.groupby(["GENDER","DEPT"]).mean()

               AGE   SALARY
GENDER DEPT
F      civil  22.0  50000.0
       cse    23.5  52500.0
       ece    21.5  65000.0
       mech   25.0  73500.0
M      civil  24.0  50000.0
       cse    22.0  80000.0
       eee    24.0  70000.0

In [7]:
a=df.groupby(["GENDER","DEPT"])
print(a.groups)

{('F', 'civil'): [4], ('F', 'cse'): [0, 5], ('F', 'ece'): [1, 2], ('F', 'mech'): [3, 6], ('M', 'civil'): [9], ('M', 'cse'): [7], ('M', 'eee'): [8]}

In [9]:
df.groupby(["SALARY"]).max()

                NAME  AGE GENDER  DEPT
SALARY
50000          pandu   24      M   cse
55000         vanaja   24      F   cse
60000   venkateswari   21      F   ece
70000          usha    24      M   eee
72000       usha sri   25      F  mech
75000          navya   25      F  mech
80000            sai   22      M   cse

In [5]:
df.groupby(["AGE"]).min()

             NAME GENDER   DEPT  SALARY
AGE
21   venkateswari      F    ece   60000
22        bhuvana      F  civil   50000
23        lakshmi      F    cse   50000
24          pandu      F  civil   50000
25          navya      F   mech   72000

In [39]:
df.groupby(["AGE"]).max()

             NAME GENDER  DEPT  SALARY
AGE
21   venkateswari      F   ece   60000
22          usha       M   ece   80000
23        lakshmi      F   cse   50000
24         vanaja      M   eee   70000
25       usha sri      F  mech   75000

In [6]:
a=df.groupby(["DEPT"])
print(a.groups)

{'civil': [4, 9], 'cse': [0, 5, 7], 'ece': [1, 2], 'eee': [8], 'mech': [3, 6]}

In [42]:
df.groupby(["AGE"]).min()

             NAME GENDER   DEPT  SALARY
AGE
21   venkateswari      F    ece   60000
22        bhuvana      F  civil   50000
23        lakshmi      F    cse   50000
24          pandu      F  civil   50000
25          navya      F   mech   72000

In [10]:
g=df.groupby(["GENDER"])
print(g.get_group("M"))

    NAME  AGE GENDER   DEPT  SALARY
7    sai   22      M    cse   80000
8  subbu   24      M    eee   70000
9  pandu   24      M  civil   50000

In [44]:
g=df.groupby(["GENDER"])
print(g.get_group("F"))

           NAME  AGE GENDER   DEPT  SALARY
0       lakshmi   23      F    cse   50000
1         usha    22      F    ece   70000
2  venkateswari   21      F    ece   60000
3         navya   25      F   mech   75000
4       bhuvana   22      F  civil   50000
5        vanaja   24      F    cse   55000
6      usha sri   25      F   mech   72000

In [45]:
g=df.groupby(["DEPT"])
print(g.get_group("ece"))

           NAME  AGE GENDER DEPT  SALARY
1         usha    22      F  ece   70000
2  venkateswari   21      F  ece   60000

In [46]:
g=df.groupby(["DEPT"])
print(g.get_group("cse"))

      NAME  AGE GENDER DEPT  SALARY
0  lakshmi   23      F  cse   50000
5   vanaja   24      F  cse   55000
7      sai   22      M  cse   80000

In [47]:
print(df["DEPT"].value_counts())
print(df["AGE"].value_counts())
print(df["NAME"].value_counts())
print(df["GENDER"].value_counts())

cse      3
ece      2
mech     2
civil    2
eee      1
Name: DEPT, dtype: int64
22    3
24    3
25    2
23    1
21    1
Name: AGE, dtype: int64
lakshmi         1
usha            1
venkateswari    1
navya           1
bhuvana         1
vanaja          1
usha sri        1
sai             1
subbu           1
pandu           1
Name: NAME, dtype: int64
F    7
M    3
Name: GENDER, dtype: int64

In [48]:
df.groupby(["GENDER"]).groups

{'F': [0, 1, 2, 3, 4, 5, 6], 'M': [7, 8, 9]}

In [49]:
df.groupby(["DEPT"]).groups

{'civil': [4, 9], 'cse': [0, 5, 7], 'ece': [1, 2], 'eee': [8], 'mech': [3, 6]}

In [50]:
df.groupby(["NAME"]).groups

{'bhuvana': [4], 'lakshmi': [0], 'navya': [3], 'pandu': [9], 'sai': [7], 'subbu': [8], 'usha ': [1], 'usha sri': [6], 'vanaja': [5], 'venkateswari': [2]}

In [51]:
df.groupby(["AGE"]).groups

{21: [2], 22: [1, 4, 7], 23: [0], 24: [5, 8, 9], 25: [3, 6]}